In [1]:
#import dependencies
from pybaseball import team_pitching
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd

from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

from pybaseball import team_batting
from pybaseball import schedule_and_record
from pybaseball import bwar_bat
import csv
import os
import json
import requests

from pybaseball import pitching_stats_range
from pybaseball import standings
import re

In [24]:
## MySQL connection
engine = create_engine('mysql+pymysql://root:password@localhost:3306/baseball_data')

#function to import data in Mysql
def import_in_sql(data, table):
    data.to_sql(name=table, con=engine, if_exists='replace', index=True)

In [25]:
#example of import data in to Mysql
#convert data in to panda dataframe
pitching_data = team_pitching(2015,2016)
pitching_data.head()
data = pd.DataFrame(data = pitching_data)
#clean data
pitching_data_sql = data[['Season','K/9']]
pitching_data_sql.rename(columns={'K/9':'K_9'}, inplace=True)
#import data in to MySQL
import_in_sql(data=pitching_data_sql, table='pitching_data_table_n')

/anaconda3/lib/python3.6/site-packages/pandas/core/frame.py:3778: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)

In [26]:
##Creating team data from 2015-2018
##Displaying the data
team_results_df = team_batting(1969, 2018)
team_results_df.head()
team_results_df[["Team", "Season", "SB"]]
team_results_sql=team_results_df[["Team", "Season", "SB"]]
#import data in to MySQL
import_in_sql(data=team_results_sql, table='team_batting')
team_results_sql.head()

        Team  Season    SB
1       Cubs  2016.0  66.0
2  Blue Jays  2015.0  88.0
3    Red Sox  2016.0  83.0
4     Astros  2017.0  98.0
5    Dodgers  2018.0  75.0

In [13]:
##Creating team list with abbreviations 
##Displaying the data
file = os.path.join("source/baseball.csv")
df = pd.read_csv(file, encoding="ISO-8859-1")
df.head()

    TeamName ABBR        HomeBase
0     Angels  LAA  Los Angeles,US
1     Astros  HOU      Houston,US
2  Athletics  OAK      Oakland,US
3   BlueJays  TOR      Toronto,CA
4     Braves  ATL      Atlanta,US

In [14]:
##Creating lists to use in for loop
abbr_list= df['ABBR'].tolist()
city_list= df['HomeBase'].tolist()
team_list= df['TeamName'].tolist()

In [7]:
##Creating short data frame for 2018
##using for loop to get number of winning and lossing games
win_num_list2018=[]
loss_num_list2018 = []
for x in abbr_list:
    schedule_data2018 = schedule_and_record(2018, x)
    schedule_data2018_short = schedule_data2018.loc[:,["Tm", "Home_Away", "Opp","W/L", "Time"]]
    wh_df = schedule_data2018_short.loc[(schedule_data2018_short["Home_Away"] == "Home")&(schedule_data2018_short["W/L"] == "W")]
    lh_df = schedule_data2018_short.loc[(schedule_data2018_short["Home_Away"] == "Home")&(schedule_data2018_short["W/L"] == "L")]
    win_num = len(wh_df['Tm'])
    loss_num = len(lh_df['Tm'])
    win_num_list2018.append(win_num)
    loss_num_list2018.append(loss_num)

In [8]:
##Creating short data frame for 2017
##using for loop to get number of winning and lossing games
win_num_list2017=[]
loss_num_list2017 = []
for x in abbr_list:
    schedule_data2017 = schedule_and_record(2017, x)
    schedule_data2017_short = schedule_data2017.loc[:,["Tm", "Home_Away", "Opp","W/L", "Time"]]
    wh_df = schedule_data2017_short.loc[(schedule_data2017_short["Home_Away"] == "Home")&(schedule_data2017_short["W/L"] == "W")]
    lh_df = schedule_data2017_short.loc[(schedule_data2017_short["Home_Away"] == "Home")&(schedule_data2017_short["W/L"] == "L")]
    win_num = len(wh_df['Tm'])
    loss_num = len(lh_df['Tm'])
    win_num_list2017.append(win_num)
    loss_num_list2017.append(loss_num)

In [9]:
##Creating short data frame for 2016
##using for loop to get number of winning and lossing games
win_num_list2016=[]
loss_num_list2016 = []
for x in abbr_list:
    schedule_data2016 = schedule_and_record(2016, x)
    schedule_data2016_short = schedule_data2016.loc[:,["Tm", "Home_Away", "Opp","W/L", "Time"]]
    wh_df = schedule_data2016_short.loc[(schedule_data2016_short["Home_Away"] == "Home")&(schedule_data2016_short["W/L"] == "W")]
    lh_df = schedule_data2016_short.loc[(schedule_data2016_short["Home_Away"] == "Home")&(schedule_data2016_short["W/L"] == "L")]
    win_num = len(wh_df['Tm'])
    loss_num = len(lh_df['Tm'])
    win_num_list2016.append(win_num)
    loss_num_list2016.append(loss_num)

In [10]:
##Creating short data frame for 2015
##using for loop to get number of winning and lossing games
win_num_list2015=[]
loss_num_list2015 = []
for x in abbr_list:
    schedule_data2015 = schedule_and_record(2015, x)
    schedule_data2015_short = schedule_data2015.loc[:,["Tm", "Home_Away", "Opp","W/L", "Time"]]
    wh_df = schedule_data2015_short.loc[(schedule_data2015_short["Home_Away"] == "Home")&(schedule_data2015_short["W/L"] == "W")]
    lh_df = schedule_data2015_short.loc[(schedule_data2015_short["Home_Away"] == "Home")&(schedule_data2015_short["W/L"] == "L")]
    win_num = len(wh_df['Tm'])
    loss_num = len(lh_df['Tm'])
    win_num_list2015.append(win_num)
    loss_num_list2015.append(loss_num)

In [11]:
##Creating short data frame for 2014
##using for loop to get number of winning and lossing games
win_num_list2014=[]
loss_num_list2014 = []
for x in abbr_list:
    schedule_data2014 = schedule_and_record(2014, x)
    schedule_data2014_short = schedule_data2014.loc[:,["Tm", "Home_Away", "Opp","W/L", "Time"]]
    wh_df = schedule_data2014_short.loc[(schedule_data2014_short["Home_Away"] == "Home")&(schedule_data2014_short["W/L"] == "W")]
    lh_df = schedule_data2014_short.loc[(schedule_data2014_short["Home_Away"] == "Home")&(schedule_data2014_short["W/L"] == "L")]
    win_num = len(wh_df['Tm'])
    loss_num = len(lh_df['Tm'])
    win_num_list2014.append(win_num)
    loss_num_list2014.append(loss_num)

In [12]:
##Creating short data frame for 2013
##using for loop to get number of winning and lossing games
win_num_list2013=[]
loss_num_list2013 = []
for x in abbr_list:
    schedule_data2013 = schedule_and_record(2013, x)
    schedule_data2013_short = schedule_data2013.loc[:,["Tm", "Home_Away", "Opp","W/L", "Time"]]
    wh_df = schedule_data2013_short.loc[(schedule_data2013_short["Home_Away"] == "Home")&(schedule_data2013_short["W/L"] == "W")]
    lh_df = schedule_data2013_short.loc[(schedule_data2013_short["Home_Away"] == "Home")&(schedule_data2013_short["W/L"] == "L")]
    win_num = len(wh_df['Tm'])
    loss_num = len(lh_df['Tm'])
    win_num_list2013.append(win_num)
    loss_num_list2013.append(loss_num)

In [15]:
api_key = "25bc90a1196e6f153eece0bc0b0fc9eb"

In [16]:
#using json request to get coordinates for each city
url = "http://api.openweathermap.org/data/2.5/weather?"
lat = []
lon = []

for city in city_list:
# Build query URL
    query_url = url + "appid=" + api_key + "&q=" + city
    response = requests.get(query_url).json()
    lat.append(response['coord']['lat'])
    lon.append(response['coord']['lon'])

In [17]:
#creating data frame with all information
overview2018 = pd.DataFrame({"year": 2018,
                             "abbr": abbr_list,
                             "team_name": team_list,
                             "home_base": city_list,
                         "win": win_num_list2018,
                         "loss": loss_num_list2018,
                        "lat": lat,
                        "lon": lon})
overview2017 = pd.DataFrame({"year": 2017,
                             "abbr": abbr_list,
                             "team_name": team_list,
                             "home_base": city_list,
                         "win": win_num_list2017,
                         "loss": loss_num_list2017,
                        "lat": lat,
                        "lon": lon})
overview2016 = pd.DataFrame({"year": 2016,
                             "abbr": abbr_list,
                             "team_name": team_list,
                             "home_base": city_list,
                         "win": win_num_list2016,
                         "loss": loss_num_list2016,
                        "lat": lat,
                        "lon": lon})
overview2015 = pd.DataFrame({"year": 2015,
                             "abbr": abbr_list,
                             "team_name": team_list,
                             "home_base": city_list,
                         "win": win_num_list2015,
                         "loss": loss_num_list2015,
                        "lat": lat,
                        "lon": lon})
overview2014 = pd.DataFrame({"year": 2014,
                             "abbr": abbr_list,
                             "team_name": team_list,
                             "home_base": city_list,
                         "win": win_num_list2014,
                         "loss": loss_num_list2014,
                        "lat": lat,
                        "lon": lon})
overview2013 = pd.DataFrame({"year": 2013,
                             "abbr": abbr_list,
                             "team_name": team_list,
                             "home_base": city_list,
                         "win": win_num_list2013,
                         "loss": loss_num_list2013,
                        "lat": lat,
                        "lon": lon})

In [19]:
# #saving files as csv
# overview2018.to_csv('source/baseball2018_coordinates.csv')
# overview2017.to_csv('source/baseball2017_coordinates.csv')
# overview2016.to_csv('source/baseball2016_coordinates.csv')
# overview2015.to_csv('source/baseball2015_coordinates.csv')
# overview2014.to_csv('source/baseball2014_coordinates.csv')
# overview2013.to_csv('source/baseball2013_coordinates.csv')

In [20]:
# #saving files as json
# overview2018.to_json('source/baseball2018_coordinates.json', orient='records')
# overview2017.to_json('source/baseball2017_coordinates.json', orient='records')
# overview2016.to_json('source/baseball2016_coordinates.json', orient='records')
# overview2015.to_json('source/baseball2015_coordinates.json', orient='records')
# overview2014.to_json('source/baseball2014_coordinates.json', orient='records')
# overview2013.to_json('source/baseball2013_coordinates.json', orient='records')

In [21]:
##merging data frames
frames = [overview2013, overview2014,overview2015, overview2016,overview2017, overview2018,]
win_loss_results = pd.concat(frames)
win_loss_results["performance"]=win_loss_results['win']/win_loss_results["loss"]
win_loss_results.head()

   year abbr  team_name       home_base  win  loss    lat     lon  performance
0  2013  LAA     Angels  Los Angeles,US   32    42  34.05 -118.24     0.761905
1  2013  HOU     Astros      Houston,US   20    57  29.76  -95.37     0.350877
2  2013  OAK  Athletics      Oakland,US   44    29  37.80 -122.27     1.517241
3  2013  TOR   BlueJays      Toronto,CA   34    41  43.65  -79.39     0.829268
4  2013  ATL     Braves      Atlanta,US   45    25  33.75  -84.39     1.800000

In [22]:
win_loss_results.to_csv('source/win_loss_results.csv')

In [27]:
#import data in to MySQL
import_in_sql(data=win_loss_results, table='win_loss_results')

In [28]:
#importing and cleaning bwar_bat data
bwar_bat_df = bwar_bat()
bwar_bat_df.sort_values(by=['year_ID'])
bwar_bat_df_new = bwar_bat_df[["name_common","player_ID","year_ID","team_ID","salary","PA","G"]]
bwar_bat_df_new = bwar_bat_df_new.replace({'NaN': None})
bwar_bat_df_new = bwar_bat_df_new[bwar_bat_df_new.salary.notna()]
bwar_bat_df_new = bwar_bat_df_new[bwar_bat_df_new.PA.notna()]
bwar_bat_df_new = bwar_bat_df_new[bwar_bat_df_new.G.notna()]

#import bwar_bat data in to MySQL
import_in_sql(data=bwar_bat_df_new, table='bwar_bat')
bwar_bat_df_new.head()

     name_common  player_ID  year_ID team_ID     salary   PA   G
0  David Aardsma  aardsda01     2004     SFG   300000.0  0.0  11
2  David Aardsma  aardsda01     2007     CHW   387500.0  0.0   2
3  David Aardsma  aardsda01     2008     BOS   403250.0  1.0   5
4  David Aardsma  aardsda01     2009     SEA   419000.0  0.0   3
5  David Aardsma  aardsda01     2010     SEA  2750000.0  0.0   4

In [29]:
#2018 Pitching data
pitching1 = pitching_stats_range('2018-03-29', '2018-10-04')
pitching2018 = pd.DataFrame(pitching1)
standings2018 = standings(2018)
results2018 = pd.concat(standings2018)
combined2018 = pitching2018.merge(results2018, on ='Tm',how = 'outer', suffixes=('_Pitcher', '_Season'))
#trying to only look at the starting pitchers
combined2018 = combined2018.query('GS >= 1')
#going to select only the necessary columns
data2018 = combined2018[['Name','Lev', 'Tm','GS','W_Season','L_Season','IP','ER','ERA','W_Pitcher','L_Pitcher']]
#creating a unique ID
re.search("(?<=\-).+","MLB-AL").group(0)
data2018["id"] = data2018["Tm"] + "-" + data2018["Lev"].map(lambda x: re.search("(?<=\-).+",x).group(0))
#dropping players that played for multiple teams
value_counts = data2018['id'].value_counts()
to_remove = value_counts[value_counts <3].index
data2018 = data2018[~data2018.id.isin(to_remove)]
export2018 = data2018.groupby('id')['IP'].sum()
export2018.to_excel('source/exportdata.xlsx')
plot2018 = pd.read_excel('source/plotdata.xlsx')
plot_data_2018 = plot2018.set_index('id')
plot_data_2018.head()

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  del sys.path[0]

              IP_2018  Wins_2018
id
Arizona-NL      929.0         82
Atlanta-NL      858.2         90
Baltimore-AL    915.2         47
Boston-AL       982.6        108
Chicago-AL     1065.4         62

In [30]:
#it works, just need to add in team Wins
export2018 = data2018.groupby('id')['IP'].sum()
export2018.to_excel('source/exportdata.xlsx')
plot2018 = pd.read_excel('source/plotdata.xlsx')
plot_data_2018 = plot2018.set_index('id')
plot_data_2018.index.rename('Team', inplace=True)
plot_data_2018_new = pd.DataFrame(plot_data_2018)
plot_data_2018_new.reset_index(inplace=True)
plot_data_2018_new.head()

           Team  IP_2018  Wins_2018
0    Arizona-NL    929.0         82
1    Atlanta-NL    858.2         90
2  Baltimore-AL    915.2         47
3     Boston-AL    982.6        108
4    Chicago-AL   1065.4         62

In [31]:
#2017 Pitching data
#looking at number of innings pitched and wins for 2017 season
pitching2 = pitching_stats_range('2017-04-02', '2017-10-02')
pitching2017 = pd.DataFrame(pitching2)
standings2017 = standings(2017)
results2017 = pd.concat(standings2017)
combined2017 = pitching2017.merge(results2018, on ='Tm',how = 'outer', suffixes=('_Pitcher', '_Season'))
#trying to only look at the starting pitchers
combined2017 = combined2017.query('GS >= 1')
#going to select only the necessary columns
data2017 = combined2017[['Name','Lev', 'Tm','GS','W_Season','L_Season','IP','ER','ERA','W_Pitcher','L_Pitcher']]
#creating a unique ID
re.search("(?<=\-).+","MLB-AL").group(0)
data2017["id"] = data2017["Tm"] + "-" + data2017["Lev"].map(lambda x: re.search("(?<=\-).+",x).group(0))
#dropping players that played for multiple teams
value_counts = data2017['id'].value_counts()
to_remove = value_counts[value_counts <3].index
data2017 = data2017[~data2017.id.isin(to_remove)]
export2017 = data2017.groupby('id')['IP'].sum()
export2017.to_excel('source/export2017.xlsx')
plot2017 = pd.read_excel('source/plot2017.xlsx')
plot_data_2017 = plot2017.set_index('id')
plot_data_2017.head()

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

              IP_2017  Wins_2017
id
Arizona-NL     1053.8         93
Atlanta-NL      779.5         72
Baltimore-AL    936.2         75
Boston-AL       975.1         93
Chicago-AL      707.8         67

In [32]:
#add in team Wins
export2017 = data2017.groupby('id')['IP'].sum()
export2017.to_excel('source/export2017.xlsx')
plot2017 = pd.read_excel('source/plot2017.xlsx')
plot_data_2017 = plot2017.set_index('id')
plot_data_2017.index.rename('Team', inplace=True)
plot_data_2017_new = pd.DataFrame(plot_data_2017)
plot_data_2017_new.reset_index(inplace=True)
plot_data_2017_new.head()

           Team  IP_2017  Wins_2017
0    Arizona-NL   1053.8         93
1    Atlanta-NL    779.5         72
2  Baltimore-AL    936.2         75
3     Boston-AL    975.1         93
4    Chicago-AL    707.8         67

In [33]:
#2016 Pitching data
pitching3 = pitching_stats_range('2016-04-03', '2016-10-02')
pitching2016 = pd.DataFrame(pitching3)
standings2016 = standings(2016)
results2016 = pd.concat(standings2016)
combined2016 = pitching2016.merge(results2018, on ='Tm',how = 'outer', suffixes=('_Pitcher', '_Season'))
#trying to only look at the starting pitchers
combined2016 = combined2016.query('GS >= 1')
#going to select only the necessary columns
data2016 = combined2016[['Name','Lev', 'Tm','GS','W_Season','L_Season','IP','ER','ERA','W_Pitcher','L_Pitcher']]
#creating a unique ID
re.search("(?<=\-).+","MLB-AL").group(0)
data2016["id"] = data2016["Tm"] + "-" + data2016["Lev"].map(lambda x: re.search("(?<=\-).+",x).group(0))
#dropping players that played for multiple teams
value_counts = data2016['id'].value_counts()
to_remove = value_counts[value_counts <4].index
data2016 = data2016[~data2016.id.isin(to_remove)]
export2016 = data2016.groupby('id')['IP'].sum()
export2016.to_excel('source/export2016.xlsx')
#manually input data
plot2016 = pd.read_excel('source/plot2016.xlsx')
plot_data_2016 = plot2016.set_index('id')
plot_data_2016.head()

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  del sys.path[0]

              IP_2016  Wins_2016
id
Arizona-NL      966.1         69
Atlanta-NL      845.2         68
Baltimore-AL    974.9         89
Boston-AL       946.5         93
Chicago-AL      831.6         78

In [34]:
#add in team Wins
export2016 = data2016.groupby('id')['IP'].sum()
export2016.to_excel('source/export2016.xlsx')
plot2016 = pd.read_excel('source/plot2016.xlsx')
plot_data_2016 = plot2016.set_index('id')
plot_data_2016.index.rename('Team', inplace=True)
plot_data_2016_new = pd.DataFrame(plot_data_2016)
plot_data_2016_new.reset_index(inplace=True)
plot_data_2016_new.head()

           Team  IP_2016  Wins_2016
0    Arizona-NL    966.1         69
1    Atlanta-NL    845.2         68
2  Baltimore-AL    974.9         89
3     Boston-AL    946.5         93
4    Chicago-AL    831.6         78

In [35]:
plot_data_2017_2016 = plot_data_2016_new.merge(plot_data_2017_new, on=['Team'], how='left')
plot_data_2018_2017_2016 = plot_data_2017_2016.merge(plot_data_2018_new, on=['Team'], how='left')
plot_data_2018_2017_2016.head()

           Team  IP_2016  Wins_2016  IP_2017  Wins_2017  IP_2018  Wins_2018
0    Arizona-NL    966.1         69   1053.8         93    929.0         82
1    Atlanta-NL    845.2         68    779.5         72    858.2         90
2  Baltimore-AL    974.9         89    936.2         75    915.2         47
3     Boston-AL    946.5         93    975.1         93    982.6        108
4    Chicago-AL    831.6         78    707.8         67   1065.4         62

In [36]:
import_in_sql(data=plot_data_2018_2017_2016, table='pitching_info')